'''Дан список с визитами по городам и странам. Напишите код, который возвращает
отфильтрованный список geo_logs, содержащий только визиты из России."
'''
from pprint import pprint
geo_logs = [
    {'visit1': ['Москва', 'Россия']},
    {'visit2': ['Дели', 'Индия']},
    {'visit3': ['Владимир', 'Россия']},
    {'visit4': ['Лиссабон', 'Португалия']},
    {'visit5': ['Париж', 'Франция']},
    {'visit6': ['Лиссабон', 'Португалия']},
    {'visit7': ['Тула', 'Россия']},
    {'visit8': ['Тула', 'Россия']},
    {'visit9': ['Курск', 'Россия']},
    {'visit10': ['Архангельск', 'Россия']}
]

rus_log = []
for i in geo_logs:
    j = i.values()
    for j in i.values():
        if j[1] == 'Россия':
            rus_log.append(i)
pprint(rus_log)
